{
    "livings": [
        {
            "id": 1,
            "name": "Caravane",
            "description": "Caravane description",
            "price": 50.00,
            "gainPerSec": 0.1,
            "ecoBonus": -1,
            "picture": "pic_Caravan.jpg",
            "modelName": "CaravanBuilding.glb"
        },
        {
            "id": 2,
            "name": "Maison simple",
            "description": "Maison simple description",
            "price": 500.00,
            "gainPerSec": 1.00,
            "ecoBonus": -5,
            "picture": "pic_LittleHouse.jpg",
            "modelName": "CottageBuilding.glb"
        },
        {
            "id": 3,
            "name": "Appartements",
            "description": "Appartements description",
            "price": 2500.00,
            "gainPerSec": 5.00,
            "ecoBonus": -10,
            "picture": "pic_Building1.jpg",
            "modelName": "HouseBuilding.glb"
        },
        {
            "id": 4,
            "name": "Maison avec étages",
            "description": "Maison avec étages description",
            "price": 5000.00,
            "gainPerSec": 10.00,
            "ecoBonus": -10,
            "picture": "pic_BigHouse.jpg",
            "modelName": "ModernBuilding_1.glb"
        },
        {
            "id": 5,
            "name": "Villa",
            "description": "Villa description",
            "price": 25000.00,
            "gainPerSec": 50.00,
            "ecoBonus": -5,
            "picture": "pic_Villa.jpg",
            "modelName": "ModernBuilding_2.glb"
        },
        {
            "id": 6,
            "name": "Manoir",
            "description": "Manoir description",
            "price": 50000.00,
            "gainPerSec": 100.00,
            "ecoBonus": -5,
            "picture": "pic_Mansion.jpg",
            "modelName": "ModernHouseBuilding.glb"
        },
        {
            "id": 7,
            "name": "Tour d’immeuble",
            "description": "Tour d’immeuble description",
            "price": 250000.00,
            "gainPerSec": 500.00,
            "ecoBonus": -15,
            "picture": "pic_Building2.jpg",
            "modelName": "PalaceBuilding.glb"
        },
        {
            "id": 8,
            "name": "Gratte-ciel",
            "description": "Gratte-ciel description",
            "price": 1000000.00,
            "gainPerSec": 2000.00,
            "ecoBonus": -20,
            "picture": "pic_Skyscraper.jpg",
            "modelName": "SkyscraperBuilding.glb"
        }
    ],
    "commerces": [
        {
            "id": 9,
            "name": "Marché",
            "description": "Marché description",
            "price": 50.00,
            "gainPerSec": 0.1,
            "ecoBonus": 10,
            "picture": "pic_SmallStore.jpg",
            "modelName": "SmallStore.glb"
        },
        {
            "id": 10,
            "name": "Magasin de bricolage",
            "description": "Magasin de bricolage description",
            "price": 500.00,
            "gainPerSec": 1.00,
            "ecoBonus": 5,
            "picture": "pic_DIYStore.jpg",
            "modelName": "DIYStore.glb"
        },
        {
            "id": 11,
            "name": "Magasin de vêtements",
            "description": "Magasin de vêtements description",
            "price": 5000.00,
            "gainPerSec": 10.00,
            "ecoBonus": -5,
            "picture": "pic_ClothingStore.jpg",
            "modelName": "ClothingStore.glb"
        },
        {
            "id": 12,
            "name": "FastFood",
            "description": "FastFood description",
            "price": 25000.00,
            "gainPerSec": 50.00,
            "ecoBonus": -5,
            "picture": "pic_FastFood.jpg",
            "modelName": "FastFood.glb"
        },
        {
            "id": 13,
            "name": "Hotel",
            "description": "Hotel description",
            "price": 50000.00,
            "gainPerSec": 100.00,
            "ecoBonus": 5,
            "picture": "pic_Hotel.jpg",
            "modelName": "Hotel.glb"
        },
        {
            "id": 14,
            "name": "Supermarché",
            "description": "Supermarché description",
            "price": 100000.00,
            "gainPerSec": 200.00,
            "ecoBonus": 5,
            "picture": "pic_SuperMarket.jpg",
            "modelName": "Supermarket.glb"
        },
        {
            "id": 15,
            "name": "Concessionnaire",
            "description": "Concessionnaire description",
            "price": 500000.00,
            "gainPerSec": 1000.00,
            "ecoBonus": -5,
            "picture": "pic_CarStore.jpg",
            "modelName": "CarStore.glb"
        },
        {
            "id": 16,
            "name": "Centre commercial",
            "description": "Centre commercial description",
            "price": 2500000.00,
            "gainPerSec": 5000.00,
            "ecoBonus": -5,
            "picture": "pic_BigStore.jpg",
            "modelName": "BigStore.glb"
        }
    ],
    "energies": [
        {
            "id": 17,
            "name": "Centrale éolienne",
            "description": "Centrale éolienne description",
            "price": 5000.00,
            "gainPerSec": 20.00,
            "ecoBonus": 20
        },
        {
            "id": 18,
            "name": "Centrale à biomasse",
            "description": "Centrale à biomasse description",
            "price": 50000.00,
            "gainPerSec": 200.00,
            "ecoBonus": 10
        },
        {
            "id": 19,
            "name": "Centrale à charbon",
            "description": "Centrale à charbon description",
            "price": 500000.00,
            "gainPerSec": 2000.00,
            "ecoBonus": -10
        },
        {
            "id": 20,
            "name": "Centrale à pétrole",
            "description": "Centrale à pétrole description",
            "price": 1000000.00,
            "gainPerSec": 4000.00,
            "ecoBonus": -10
        },
        {
            "id": 21,
            "name": "Centrale solaire",
            "description": "Centrale solaire description",
            "price": 5000000.00,
            "gainPerSec": 20000.00,
            "ecoBonus": 20
        },
        {
            "id": 22,
            "name": "Centrale géothermique",
            "description": "Centrale géothermique description",
            "price": 10000000.00,
            "gainPerSec": 40000.00,
            "ecoBonus": 50
        },
        {
            "id": 23,
            "name": "Centrale hydroélectrique",
            "description": "Centrale hydroélectrique description",
            "price": 50000000.00,
            "gainPerSec": 200000.00,
            "ecoBonus": 50
        },
        {
            "id": 24,
            "name": "Centrale nucléaire",
            "description": "Centrale nucléaire description",
            "price": 100000000.00,
            "gainPerSec": 400000.00,
            "ecoBonus": 15
        }
    ],
    "improvements": [
        {
            "id":25,
            "name": "Programme de compostage",
            "desc": "Le joueur peut débloquer un programme de compostage pour les déchets alimentaires et de jardin, ce qui permet de produire du compost pour une utilisation locale dans les jardins communautaires ou les parcs de la ville, réduisant ainsi la quantité de déchets organiques envoyés en décharge.",
            "price": 100.00,
            "gainPerSec": 0.1,
            "ecoBonus": 1,
            "gainPerClick": 1.00
        },
        {
            "id":26,
            "name": "Centres de tri avancés",
            "desc": "Le joueur peut débloquer des centres de tri modernisés et efficaces, équipés de technologies de pointe pour trier les matériaux recyclables tels que le plastique, le papier, le verre, et le métal de manière plus précise et efficace, permettant ainsi d'augmenter le taux de recyclage de la ville.",
            "price": 1000.00,
            "gainPerSec": 1.00,
            "ecoBonus": 5,
            "gainPerClick": 10.00
        },
        {
            "id":27,
            "name": "Programme de récupération des déchets électroniques",
            "desc": "Le joueur peut mettre en place un programme de récupération des déchets électroniques, tels que les ordinateurs, les téléphones portables, et autres appareils électroniques, en permettant aux citoyens de les déposer dans des points de collecte spécifiques pour un recyclage approprié ou une réutilisation.",
            "price": 10000.00,
            "gainPerSec": 10.00,
            "ecoBonus": 10,
            "gainPerClick": 100.00
        },
        {
            "id":28,
            "name": "Système de récompense pour le tri des déchets",
            "desc": "Le joueur peut débloquer un système de récompense pour encourager les citoyens à trier correctement leurs déchets. Les citoyens peuvent recevoir des bonus ou des réductions d'impôt en fonction de la qualité de leur tri, incitant ainsi à une meilleure gestion des déchets.",
            "price": 100000.00,
            "gainPerSec": 100.00,
            "ecoBonus": 15,
            "gainPerClick": 1000.00
        },
        {
            "id":29,
            "name": "Programme de réduction des déchets à la source",
            "desc": "Le joueur peut débloquer un programme de sensibilisation et d'éducation pour aider les citoyens à réduire la production de déchets à la source, par exemple en encourageant l'utilisation de produits réutilisables, en promouvant l'économie circulaire ou en proposant des alternatives aux emballages jetables.",
            "price": 1000000.00,
            "gainPerSec": 1000.00,
            "ecoBonus": 20,
            "gainPerClick": 10000.00
        },
        {
            "id":30,
            "name": "Amélioration des infrastructures de collecte des déchets",
            "desc": "Le joueur peut débloquer des améliorations des infrastructures de collecte des déchets, telles que des bacs de recyclage supplémentaires dans les quartiers résidentiels, des points de collecte sélective dans les lieux publics, ou des systèmes de collecte pneumatique pour optimiser la gestion des déchets.",
            "price": 10000000.00,
            "gainPerSec": 10000.00,
            "ecoBonus": 25,
            "gainPerClick": 100000.00
        },
        {
            "id":31,
            "name": "Extension du réseau de transport public",
            "desc": "Le joueur peut débloquer de nouvelles lignes de transport en commun, telles que des lignes de bus, de tramway, de métro, ou de trains, pour étendre le réseau de transport public de la ville et permettre aux citoyens d'avoir accès à plus de destinations sans avoir besoin d'utiliser des véhicules privés.",
            "price": 200.00,
            "gainPerSec": 0.20,
            "ecoBonus": 1,
            "gainPerClick": 2.00
        },
        {
            "id":32,
            "name": "Amélioration des véhicules de transport public",
            "desc": "Le joueur peut débloquer des véhicules de transport public plus écologiques, tels que des bus électriques, des trains à hydrogène, ou des trams alimentés par des énergies renouvelables, afin de réduire les émissions de gaz à effet de serre et de promouvoir une mobilité durable dans la ville.",
            "price": 2000.00,
            "gainPerSec": 2.00,
            "ecoBonus": 5,
            "gainPerClick": 20.00
        },
        {
            "id":33,
            "name": "Infrastructures pour les véhicules électriques",
            "desc": "Le joueur peut débloquer des infrastructures de recharge pour les véhicules électriques, tels que des bornes de recharge rapide dans les stations de transport en commun, les parkings publics, ou les lieux stratégiques de la ville, pour encourager l'utilisation de véhicules électriques dans le réseau de transport public.",
            "price": 20000.00,
            "gainPerSec": 20.00,
            "ecoBonus": 10,
            "gainPerClick": 200.00
        },
        {
            "id":34,
            "name": "Amélioration de la fréquence et de la ponctualité des transports en commun",
            "desc": "Le joueur peut débloquer des améliorations pour augmenter la fréquence et la ponctualité des transports en commun, ce qui rendra le réseau de transport public plus attractif pour les citoyens et les incitera à l'utiliser davantage comme alternative aux véhicules privés.",
            "price": 200000.00,
            "gainPerSec": 200.00,
            "ecoBonus": 15,
            "gainPerClick": 2000.00
        },
        {
            "id":35,
            "name": "Accessibilité améliorée",
            "desc": "Le joueur peut débloquer des améliorations pour rendre le réseau de transport public plus accessible aux personnes à mobilité réduite, par exemple en ajoutant des rampes d'accès, des ascenseurs, ou des annonces sonores pour les personnes malvoyantes, afin de garantir que le transport public soit accessible à tous les citoyens de la ville.",
            "price": 2000000.00,
            "gainPerSec": 2000.00,
            "ecoBonus": 20,
            "gainPerClick": 20000.00
        },
        {
            "id":36,
            "name": "Programme de covoiturage ou de partage de véhicules",
            "desc": "Le joueur peut débloquer un programme de covoiturage ou de partage de véhicules, permettant aux citoyens de partager des trajets en utilisant des véhicules publics, tels que des voitures, des vélos, ou des trottinettes électriques, pour réduire le nombre de véhicules privés sur les routes et encourager une mobilité plus durable.",
            "price": 20000000.00,
            "gainPerSec": 20000.00,
            "ecoBonus": 25,
            "gainPerClick": 200000.00
        },
        {
            "id":37,
            "name": "Subventions pour l'installation de panneaux solaires",
            "desc": "Le joueur peut débloquer des améliorations pour offrir des subventions non seulement aux propriétaires de maisons, mais aussi aux propriétaires de bâtiments publics, tels que les écoles, les bibliothèques, les hôpitaux, etc., pour les encourager à installer des panneaux solaires et à promouvoir l'énergie solaire dans toute la ville.",
            "price": 300.00,
            "gainPerSec": 0.30,
            "ecoBonus": 1,
            "gainPerClick": 3.00
        },
        {
            "id":38,
            "name": "Augmentation du taux de subvention",
            "desc": "Le joueur peut débloquer des améliorations pour augmenter le taux de subvention offert aux propriétaires qui installent des panneaux solaires sur leur toit. Cela peut inciter davantage de propriétaires à adopter l'énergie solaire en rendant l'investissement plus attractif financièrement.",
            "price": 3000.00,
            "gainPerSec": 3.00,
            "ecoBonus": 5,
            "gainPerClick": 30.00
        },
        {
            "id":39,
            "name": "Subventions pour les batteries de stockage d'énergie",
            "desc": "Le joueur peut débloquer des améliorations pour offrir des subventions non seulement pour l'installation de panneaux solaires, mais aussi pour l'achat et l'installation de batteries de stockage d'énergie, ce qui permet aux propriétaires de stocker l'énergie solaire produite et de l'utiliser pendant les périodes de faible ensoleillement ou en cas de coupure d'électricité.",
            "price": 30000.00,
            "gainPerSec": 30.00,
            "ecoBonus": 10,
            "gainPerClick": 300.00
        },
        {
            "id":40,
            "name": "Programme de financement à faible taux d'intérêt",
            "desc": "Le joueur peut débloquer des améliorations pour mettre en place un programme de financement à faible taux d'intérêt pour les propriétaires qui souhaitent installer des panneaux solaires, ce qui peut rendre l'investissement plus accessible et attractif pour un plus grand nombre de propriétaires.",
            "price": 300000.00,
            "gainPerSec": 300.00,
            "ecoBonus": 15,
            "gainPerClick": 3000.00
        },
        {
            "id":41,
            "name": "Promotion de l'autoconsommation et de la revente de l'énergie solaire",
            "desc": "Le joueur peut débloquer des améliorations pour encourager l'autoconsommation de l'énergie solaire produite par les panneaux solaires installés, ainsi que la revente de l'excédent d'énergie produite à la grille électrique locale. Cela peut permettre aux propriétaires de réaliser des économies sur leur facture d'électricité et de contribuer à la production d'énergie renouvelable dans la ville.",
            "price": 3000000.00,
            "gainPerSec": 3000.00,
            "ecoBonus": 20,
            "gainPerClick": 30000.00
        },
        {
            "id":42,
            "name": "Campagnes de sensibilisation sur le tri des déchets",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation pour encourager les habitants de la ville à trier leurs déchets de manière appropriée, en mettant l'accent sur l'importance du recyclage, de la compostage et de la réduction des déchets.",
            "price": 400.00,
            "gainPerSec": 0.40,
            "ecoBonus": 1,
            "gainPerClick": 4.00
        },
        {
            "id":43,
            "name": "Campagnes de sensibilisation sur la consommation responsable",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation sur la consommation responsable, en mettant en avant les avantages de l'achat local, du commerce équitable, des produits durables et de la réduction de la consommation de ressources naturelles.",
            "price": 4000.00,
            "gainPerSec": 4.00,
            "ecoBonus": 5,
            "gainPerClick": 40.00
        },
        {
            "id":44,
            "name": "Campagnes de sensibilisation sur la mobilité durable",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation sur la mobilité durable, en encourageant l'utilisation du transport public, du covoiturage, du vélo, de la marche et d'autres modes de transport écologiques, ainsi que la réduction de l'utilisation des véhicules individuels à moteur thermique.",
            "price": 40000.00,
            "gainPerSec": 40.00,
            "ecoBonus": 10,
            "gainPerClick": 400.00
        },
        {
            "id":45,
            "name": "Campagnes de sensibilisation sur l'économie d'énergie",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation sur l'économie d'énergie, en mettant l'accent sur l'importance de la gestion efficace de l'énergie dans les bâtiments, les transports et les activités quotidiennes, ainsi que sur l'utilisation d'appareils économes en énergie et la réduction du gaspillage d'énergie.",
            "price": 400000.00,
            "gainPerSec": 400.00,
            "ecoBonus": 15,
            "gainPerClick": 4000.00
        },
        {
            "id":46,
            "name": "Campagnes de sensibilisation sur la protection de la biodiversité",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation sur la protection de la biodiversité, en mettant en avant l'importance de la préservation des espaces naturels, de la plantation d'arbres, de la protection des habitats naturels, de la conservation des espèces en danger et de l'utilisation de pratiques agricoles durables.",
            "price": 4000000.00,
            "gainPerSec": 4000.00,
            "ecoBonus": 20,
            "gainPerClick": 40000.00
        },
        {
            "id":47,
            "name": "Campagnes de sensibilisation sur la gestion de l'eau",
            "desc": "Le joueur peut débloquer des améliorations pour lancer des campagnes de sensibilisation sur la gestion de l'eau, en mettant en avant l'importance de la conservation de l'eau, de la réduction du gaspillage d'eau, de la collecte d'eau de pluie, de l'utilisation d'équipements économes en eau et de la protection des ressources en eau.",
            "price": 4000000.00,
            "gainPerSec": 40000.00,
            "ecoBonus": 25,
            "gainPerClick": 400000.00
        }
    ]
}